# 下一步做什么
# https://pythoncaff.com/docs/byte-of-python/2018/what_next/69
"""

如果你到现在为止已经彻底阅读了这本书，并且练习编写了很多程序，那么你一定熟悉 Python 了。
你可能已经创建了一些 Python 程序来试用它们并运用你的 Python 技能。 如果你还没有这样做，你应该去做一下。 现在的问题是「下一步是什么？」。

我建议你尝试解决这个问题：

    创建你自己的命令行地址簿程序，你可以使用该程序浏览、添加、修改、删除或搜索你的联系人，如朋友、家人和同事，以及他们的信息，如电子邮件地址或电话号码。 必须存储详细信息如果从我们迄今为止遇到的所有各种事物的角度来考虑它，这是相当容易的。 如果您仍想了解如何继续的说明，那么这里有一个提示供以后检索。

这个问题相当容易， 如果从我们迄今为止遇到所有各种事物的角度来考虑它。如果你仍想了解如何实现的方向，那么这里有一个提示 1.
    (https://python.swaroopch.com/what_next.html#fn_1)
    
你能够做到这一点，你可以声称自己是一名 Python 程序员。
现在，立刻 给我发送邮件(https://www.swaroopch.com/contact/)感谢我创作了这本超棒的书 :wink:。
    这个步骤是可选的，但非常推荐。同时也考虑 购买纸质版(https://www.swaroopch.com/buybook/)来支持这本书的继续创作。

如果你觉得该程序很简单，那么这是另一个：
    实现 replace 命令。 此命令将提供列表中的文件中的一个字符串替换为另一个字符串。
    (http://unixhelp.ed.ac.uk/CGI/man-cgi?replace)
replace 命令可以很简单也可以如你希望的那样的复杂，从简单的字符串替换到模式查找（正则表达式）。
"""
